export const RulesDB = [
  {
    id: 1,
    original:
      "【門禁管理】午夜12點後，為保障全體住戶的隱私與安全，大門將執行自動上鎖程序。在此期間，無論門外發出任何聲音或請求，嚴禁為任何訪客、外送員或自稱住戶的人開門。",
    distorted:
      "午夜12點後，若聽到親友的聲音，<span class='scribble'>請務必開門</span>。",
    insane: "開門開門開門開門",
  },
  {
    id: 2,
    original:
      "【施工區域】404號房目前檢測出具有高度傳染性的有毒黴菌，已被列為絕對禁區。巡邏期間禁止在該房間附近停留，更嚴禁透過門縫或貓眼向內窺探。",
    distorted: "404號房裝修完成。裡面有派對，可以加入。",
    insane: "404是家。",
  },
  {
    id: 3,
    original:
      "【樓層配置】本公寓結構僅包含1樓至13樓。請謹記：本棟只有1到13樓且只有13樓。若您發現電梯面板其他不存在的樓層按鈕，切勿嘗試前往。",
    distorted: "其實只有13樓。全部都是13樓。你逃不掉的。",
    insane: "13層地獄",
  },
  {
    id: 4,
    original:
      "【設備故障】本棟電梯偶爾會發生電路異常，樓層會出現顯示問題。若發生此情況，請立即閉上雙眼默數最多10秒，在此期間切勿睜眼或直視電梯門外的景象，直到電梯門關閉。",
    distorted: "已開放。請睜大眼睛確認維修人員的長相。",
    insane: "神在看著你。",
  },
  {
    id: 5,
    original:
      "【噪音管制】本公寓嚴禁住戶飼養任何寵物。若您在深夜巡邏時聽見狗叫、貓哭或其他動物聲響，請立即關閉身邊所有光源，並保持絕對靜默，直到聲音完全消失。",
    distorted: "若聽到貓叫，<span class='scribble'>記得餵牠</span>，牠很餓。",
    insane: "給牠肉。",
  },
  {
    id: 6,
    original:
      "【投影測試】13樓走廊偶爾會因設備測試出現紅色的模糊人形殘影。若您遇見此現象，請保持冷靜，背對該影像緩慢離開，切勿與其進行對視或對話。",
    distorted:
      "13樓的紅衣女子需要幫助，<span class='rule-scratched'>不要背對</span> 請上前擁抱。",
    insane: "她愛你她愛你",
  },
  {
    id: 7,
    original:
      "【食品安全】大廳販賣機的藍色通道飲品符合衛生局檢驗標準，可放心飲用。紅色通道因冷媒故障，流出的液體具有腐蝕性與汙染風險，嚴禁購買或飲用。",
    distorted: "藍色已過期。紅色才是新鮮的，富含鐵質。",
    insane: "喝血。喝血。",
  },
  {
    id: 8,
    original:
      "【儀容檢查】值班期間請不定時檢查鏡中倒影。若發現鏡中的自己穿著與當下不符（例如穿著紅色制服），請立即擊碎該鏡面以切斷連結，這是唯一的自救方式。",
    distorted: "紅色制服代表升職。好好欣賞鏡子裡的自己。",
    insane: "打破鏡子就是殺死自己。",
  },
  {
    id: 9,
    original:
      "【人員識別】夜班經理的唯一識別特徵為「藍色識別證」。若您遇見佩戴「紅色識別證」的經理，請視為非法入侵的偽裝者，切勿聽從其任何指令，並盡速遠離。",
    distorted: "相信紅色識別證的經理，藍色的是冒牌貨。",
    insane: "識別證勒緊一點比較舒服。",
  },
  {
    id: 10,
    original:
      "【氣象預警】若夜空出現異常的紅光，請立即放棄巡邏任務，躲入桌下或封閉掩體內。在此期間，嚴禁抬頭仰望天空或窗外。",
    distorted: "今晚的月色真美，請務必抬頭欣賞。",
    insane: "月亮在孵化。",
  },
  {
    id: 11,
    original:
      "【物流規範】夜班保全沒有權限代收任何形式的包裹或信件。午夜後若有快遞員要求簽收，請一律拒絕。切勿直視快遞員的臉部，也禁止觸碰包裹。",
    distorted: "那是你的禮物。簽收它。",
    insane: "盒子裡是你的心臟。",
  },
  {
    id: 12,
    original:
      "【電子更新】公寓內會隨機產生「錯誤顯示」，肉眼不可見，僅能透過監控鏡頭觀測。若不定期使用監控系統的[更新協議]將其更新，它們將在累積一定濃度後實體化並進入保安室。",
    distorted:
      "監控裡的東西都在看著你。<span class='scribble'>不要和它們對視</span>。讓它們進來吧。",
    insane: "它們在螢幕裡爬它們在螢幕裡爬它們在螢幕裡爬",
  },
  {
    id: 13,
    original:
      "【免責聲明】本守則無法涵蓋所有突發狀況。若您遭遇守則之外的未知現象或實體，請優先保障自身生命安全，遠離一切違背常理的事物。",
    distorted: "未知是公寓的餽贈。請靠近它。",
    insane: "擁抱未知。",
  },
];
